Revit 2021.1 API
SpecTypeId Members
The SpecTypeId type exposes the following members.
Properties
Name | Description
Acceleration
AirFlow
AirFlowDensity
AirFlowDividedByCoolingLoad
AirFlowDividedByVolume
Angle
AngularSpeed
ApparentPower
Area
AreaDividedByCoolingLoad
AreaDividedByHeatingLoad
AreaForce
AreaForceScale
AreaSpringCoefficient
BarDiameter
CableTraySize
ColorTemperature
ConduitSize
CoolingLoad
CoolingLoadDividedByArea
CoolingLoadDividedByVolume
CostPerArea
CostRateEnergy
CostRatePower
CrackWidth
CrossSection
Currency
Current
Custom
DecimalSheetLength
DemandFactor
Diffusivity
Displacement
Distance
DuctInsulationThickness
DuctLiningThickness
DuctSize
Efficacy
ElectricalFrequency
ElectricalPotential
ElectricalPower
ElectricalPowerDensity
ElectricalResistivity
ElectricalTemperature
ElectricalTemperatureDifference
Energy
Factor
Flow
FlowPerPower
Force
ForceScale
HeatGain
HeatingLoad
HeatingLoadDividedByArea
HeatingLoadDividedByVolume
HeatTransferCoefficient
HvacDensity
HvacEnergy
HvacFriction
HvacMassPerTime
HvacPower
HvacPowerDensity
HvacPressure
HvacRoughness
HvacSlope
HvacTemperature
HvacTemperatureDifference
HvacVelocity
HvacViscosity
Illuminance
IsothermalMoistureCapacity
Length
LinearForce
LinearForceScale
LinearMoment
LinearMomentScale
LineSpringCoefficient
Luminance
LuminousFlux
LuminousIntensity
Mass
MassDensity
MassPerUnitArea
MassPerUnitLength
Moment
MomentOfInertia
MomentScale
Number
Period
Permeability
PipeDimension
PipeInsulationThickness
PipeMassPerUnitLength
PipeSize
PipingDensity
PipingFriction
PipingMass
PipingMassPerTime
PipingPressure
PipingRoughness
PipingSlope
PipingTemperature
PipingTemperatureDifference
PipingVelocity
PipingViscosity
PipingVolume
PointSpringCoefficient
PowerPerFlow
PowerPerLength
Pulsation
ReinforcementArea
ReinforcementAreaPerUnitLength
ReinforcementCover
ReinforcementLength
ReinforcementSpacing
ReinforcementVolume
Rotation
RotationalLineSpringCoefficient
RotationalPointSpringCoefficient
RotationAngle
SectionArea
SectionDimension
SectionModulus
SectionProperty
SheetLength
SiteAngle
Slope
SpecificHeat
SpecificHeatOfVaporization
Speed
Stationing
StationingInterval
Stress
StructuralFrequency
StructuralVelocity
SurfaceAreaPerUnitLength
ThermalConductivity
ThermalExpansionCoefficient
ThermalGradientCoefficientForMoistureCapacity
ThermalMass
ThermalResistance
Time
UnitWeight
Volume
WarpingConstant
Wattage
Weight
WeightPerUnitLength
WireDiameter
See Also
SpecTypeId Class
Autodesk.Revit.DB Namespace